MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/dsPIC33EP512GP806/hal_ll_pps_connection_defs.h
    {GPIO_PIN_8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 40, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB9_RPI41
    {GPIO_PIN_9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 41, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC12_RPI60
    {GPIO_PIN_12, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 60, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC13_RPI61
    {GPIO_PIN_13, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 61, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC14_RPI62
    {GPIO_PIN_14, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 62, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD0_RP64
    {GPIO_PIN_0, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 64, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD1_RP65
    {GPIO_PIN_1, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 65, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD10_RPI74
    {GPIO_PIN_10, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 74, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD11_RPI75
    {GPIO_PIN_11, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 75, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD2_RP66
    {GPIO_PIN_2, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 66, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD3_RP67
    {GPIO_PIN_3, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 67, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD4_RP68
    {GPIO_PIN_4, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 68, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD5_RP69
    {GPIO_PIN_5, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 69, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD6_RP70
    {GPIO_PIN_6, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 70, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD7_RP71
    {GPIO_PIN_7, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 71, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD8_RPI72
    {GPIO_PIN_8, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 72, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD9_RPI73
    {GPIO_PIN_9, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 73, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE0_RP80
    {GPIO_PIN_0, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 80, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE1_RPI81
    {GPIO_PIN_1, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 81, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE2_RP82
    {GPIO_PIN_2, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 82, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE3_RPI83
    {GPIO_PIN_3, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 83, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE4_RP84
    {GPIO_PIN_4, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 84, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE5_RP85
    {GPIO_PIN_5, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 85, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE6_RPI86
    {GPIO_PIN_6, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 86, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE7_RP87
    {GPIO_PIN_7, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 87, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF0_RP96
    {GPIO_PIN_0, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 96, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF1_RP97
    {GPIO_PIN_1, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 97, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF2_RP98
    {GPIO_PIN_2, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 98, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF3_RP99
    {GPIO_PIN_3, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 99, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF4_RP100
    {GPIO_PIN_4, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 100, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF5_RP101
    {GPIO_PIN_5, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 101, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF6_RP102
    {GPIO_PIN_6, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 102, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG6_RP118
    {GPIO_PIN_6, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 118, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG7_RPI119
    {GPIO_PIN_7, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 119, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG8_RP120
    {GPIO_PIN_8, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 120, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG9_RPI121
    {GPIO_PIN_9, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 121, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif

    { HAL_LL_PIN_NC, HAL_LL_PORT_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR, HAL_LL_MODULE_ERROR }
};

